Repository: FoodStandardsAgency/food_gov_uk_d8
Catalog: translations/*_fsa.po
Languages: cy

source: A–Z
cy: A–Y

source: Search from...
cy: Chwilio o…

source: About us
cy: Amdanom ni

source: Food Standards Agency makes sure food is safe to eat and what it says it is.
cy: Mae’r Asiantaeth Safonau Bwyd yn sicrhau bod bwyd yn ddiogel i’w fwyta a beth y mae’n ei ddweud.

source: Search
cy: Chwilio

source: Home
cy: Hafan

source: Food hygiene ratings search
cy: Chwiliad sgoriau hylendid bwyd

source: Business name/or location
cy: Enw busnes/neu’r lleoliad

source: More search options
cy: Rhagor o opsiynau chwilio

source: Business type
cy: Math o fusnes

source: Local authority
cy: Awdurdod lleol

source: Hygiene rating
cy: Hylendid

source: Exempt
cy: Wedi’i eithrio

source: Results
cy: Canlyniadau

source: Sort results by
cy: Didoli canlyniadau gan

source: Relevance
cy: Allweddair perthnasol

source: Ratings (highest to lowest)
cy: Graddfa (uchaf i’r isaf)

source: Rating (lowest to highest)
cy: Graddfa (isaf i'r uchaf)

source: Name (A to Z)
cy: Enw (A i Z)

source: Name (Z to A)
cy: Enw (Z i A)

source: Rating
cy: Sgôr

source: Inspection date
cy: Dyddiad arolygu

source: Page @start of @end
cy: Tudalen @start o @end

source: Back to form
cy: Yn ôl at y ffurflen

source: {Empty}
cy: {Gwag}

source: View PDF
cy: Gweler PDF

source: Enter a location
cy: Rhowch leoliad

source: Yes
cy: Ydw

source: No
cy: Na

source: Manage your preferences
cy: Rheoli eich dewisiadau

source: Manage your subscription
cy: Rheoli eich tanysgrifiadau

source: Logout
cy: Allgofnodi

source: Cancel your subscription
cy: Canslo eich tanysgrifiad

source: Save your changes
cy: Arbed eich newidiadau

source: News and consultations
cy: Newyddion ac ymgynghoriadau

source: Delivery options
cy: Opsiynau anfon

source: Update your subscription or unsubscribe from the alerts you're receiving
cy: Ewch ati i ddiweddaru eich tanysgrifiad neu ddatdanysgrifio o'r rhybuddion rydych chi'n eu cael

source: Password
cy: Cyfrinair

source: Password should be at least @length characters
cy: Dylai'r cyfrinair gynnwys o leiaf @length nod

source: Profile removed
cy: Proffil wedi'i ddileu

source: Passwords match:
cy: Cyfrineiriau yn cyd-fynd:

source: This will cancel all your subscriptions and permanently remove your personal details.
cy: Bydd hyn yn canslo eich holl danysgrifiadau ac yn dileu eich manylion personol.

source: Confirm removal
cy: Cadarnhau eich bod am ddileu

source: Remove your profile
cy: Dileu eich proffil

source: Save changes
cy: Arbed newidiadau

source: Subscribe to news and alerts
cy: Tanysgrifio i newyddion a rhybuddion

source: Stay up to date with food and allergy alerts, FSA news and consultations.
cy: Y diweddaraf am rybuddion bwyd ac alergedd, newyddion ac ymgynghoriadau'r ASB.

source: Food and allergy alerts
cy: Rhybuddion bwyd ac alergedd

source: Food alerts
cy: Rhybuddion bwyd

source: Allergy alerts
cy: Rhybuddion alergedd

source: News
cy: Newyddion

source: Consultations
cy: Ymgynghoriadau

source: I want to receive food and allergy alerts via
cy: Rydw i eisiau cael rhybuddion bwyd ac alergedd drwy...

source: I want to receive news and consultations via
cy: Rydw i eisiau cael newyddion ac ymgynghoriadau drwy...

source: Frequency
cy: Pa mor aml

source: SMS frequency
cy: Amlder SMS

source: SMS updates are sent immediately
cy: Hysbysiadau SMS yn cael eu hanfon ar unwaith

source: Email frequency
cy: Amlder e-bost

source: Personal information
cy: Gwybodaeth bersonol

source: Language preference
cy: Dewis iaith

source: All allergy alerts
cy: Yr holl rybuddion alergedd

source: Celery
cy: Seleri

source: Crustaceans
cy: Cramenogion

source: Egg
cy: Wyau

source: Fish
cy: Pysgod

source: Gluten
cy: Glwten

source: Lupin
cy: Bys y blaidd

source: Milk
cy: Llaeth

source: Molluscs
cy: Molysgiaid

source: Mustard
cy: Mwstard

source: Nuts
cy: Cnau

source: Peanuts
cy: Pysgnau

source: Soya
cy: Soai

source: Sulphur dioxide and/or sulphites
cy: Sylffwr deuocsid a/neu sylffitau

source: All news
cy: Yr holl newyddion

source: Board meeting news
cy: Newyddion am y cyfarfod bwrdd

source: Business and industry news
cy: Newyddion busnes a'r diwydiant

source: Northern Ireland news
cy: Newyddion Gogledd Iwerddon

source: Science news
cy: Newyddion gwyddoniaeth

source: Wales news
cy: Newyddion Cymru

source: All consultations
cy: Yr holl ymgynghoriadau

source: Consultation
cy: Ymgynghoriad

source: Help shape our policies
cy: Helpu i lywio ein polisïau

source: Rapidly developing policies
cy: Polisïau sy'n datblygu'n gyflym

source: Email
cy: E-bost

source: Send updates immediately
cy: Anfon hysbysiadau ar unwaith

source: Send updates daily
cy: Anfon diweddariadau bob dydd

source: Send updates weekly
cy: Anfon diweddariadau bob wythnos

source: Email address
cy: Cyfeiriad e-bost

source: Back
cy: Yn ôl

source: Your profile
cy: Eich proffil chi

source: Manage your profile
cy: Rheoli eich proffil

source: Privacy notice
cy: Hysbysiad preifatrwydd

source: New password
cy: Cyfrinair newydd

source: Confirm password
cy: Cadarnhau'r cyfrinair

source: Food hygiene ratings
cy: Sgoriau Hylendid Bwyd

source: Country or local authority
cy: Gwlad neu awdurdod lleol

source: Hygiene
cy: Hylendid

source: England, Northern Ireland, Wales
cy: Lloegr, Canllawiau Gogledd, Cymru

source: Hygiene status
cy: Statws hylendid

source: Scotland
cy: Yr Alban

source: Very good
cy: Da iawn

source: Good
cy: Da

source: Generally satisfactory
cy: Boddhaol ar y cyfan

source: Improvement necessary
cy: Angen gwella

source: Major improvement necessary
cy: Angen gwella yn sylweddol

source: Urgent improvement necessary
cy: Angen gwella ar frys

source: Back to ratings search
cy: Yn ôl i chwilio am sgoriau

source: Find out more about food hygiene ratings
cy: Rhagor o wybodaeth am y sgoriau

source: Area inspected by food safety officer
cy: Yr ardal a arolygwyd gan y swyddog diogelwch bwyd

source: Hygienic handling of food including preparation, cooking, re-heating, cooling and storage
cy: Trin bwyd yn hylan gan gynnwys paratoi, coginio, ailgynhesu, oeri a storio

source: Cleanliness and condition of facilities and building
cy: Glanweithdra a chyflwr y cyfleusterau a'r adeilad

source: Cleanliness and condition of facilities and building (including having appropriate layout, ventilation, hand washing facilities and pest control) to enable good food hygiene
cy: Glanweithdra a chyflwr y cyfleusterau a'r adeilad (gan gynnwys dyluniad priodol, awyru, cyfleusterau golchi dwylo a rheoli plâu) yn galluogi hylendid bwyd da

source: Management of food safety
cy: Mesurau rheoli diogelwch bwyd

source: System or checks in place to ensure that food sold or served is safe to eat, evidence that staff know about food safety, and the food safety officer has confidence that standards will be maintained in future.
cy: System neu wiriadau ar waith i sicrhau bod y bwyd a gaiff ei werthu neu ei weini yn ddiogel i'w fwyta, tystiolaeth bod y staff yn gwybod am ddiogelwch bwyd, a bod gan y swyddog diogelwch bwyd hyder y bydd y safonau'n cael eu cynnal yn y dyfodol.

source: Are you the business owner or manager?
cy: Ai chi yw perchennog neu reolwr y busnes?

source: If any information on this page is incorrect you can email the correct information to your local authority by using the email address below.
cy: Os oes unrhyw wybodaeth sy'n anghywir ar y dudalen hon, gallwch anfon yr wybodaeth gywir at eich awdurdod lleol gan ddefnyddio'r cyfeiriad e-bost isod.

source: You can find out how to appeal against the rating given and find out about your right to reply. You can also ask for a re-inspection.
cy: Gallwch ganfod sut i apelio yn erbyn y sgôr a dderbyniwyd ac am eich hawl i ymateb. Gallwch hefyd ofyn am ailarolygiad.

source: Display this rating on your website
cy: Arddangos y sgôr hon ar eich gwefan

source: You can display this rating on your website.
cy: Gallwch arddangos y sgôr hon ar eich gwefan.

source: Get badges
cy: Bathodynnau

source: Do you want to get a copy of the report?
cy: Ydych chi eisiau copi o'r adroddiad?

source: If you wish to see the food safety officer’s report on which this rating is based, you can request this from the local authority that carried out the inspection. You can do this by sending an email to the address below. The local authority will consider your request and will usually send you a copy of the report. In some cases, the local authority may decide that they cannot do so but will let you know this and explain why.
cy: Os hoffech weld adroddiad y swyddog diogelwch bwyd sy'n sail i'r sgôr hon, gallwch ofyn i’w weld gan yr awdurdod lleol a gynhaliodd yr arolygiad. Gallwch wneud hyn drwy anfon e-bost i’r cyfeiriad isod. Bydd yr awdurdod lleol yn ystyried eich cais, ac fel arfer bydd yn anfon copi o’r adroddiad atoch. Mewn rhai achosion, gallai’r awdurdod lleol benderfynu nad oes modd iddo wneud hynny. Os felly, bydd yr awdurdod lleol yn rhoi gwybod i chi am hynny ac yn egluro pam.

source: Inspecting council
cy: Cyngor arolygu

source: Hygienic food handling
cy: Trin bwyd yn hylan

source: Standards found
cy: Y safonau a ganfuwyd

source: Awaiting Rating
cy: Aros am sgôr

source: Address
cy: Cyfeiriad

source: Show on a map
cy: Dangos ar fap

source: Next ›
cy: Nesaf ›

source: Last »
cy: Diwethaf »

source: « First
cy: « Gyntaf

source: ‹ Previous
cy: ‹ Blaenorol

source: What is the Food Hygiene Rating Scheme?
cy: Beth yw'r Cynllun Sgorio Hylendid Bwyd?

source: What do the different ratings mean
cy: Beth mae'r sgoriau'n ei olygu

source: Showing <span>@items</span> of <span>@total</span>
cy: Yn dangos <span>@items</span> o <span>@total</span>

source: results
cy: canlyniadau

source: This is a new service – your <a href="/feedback">feedback</a> will help us to improve it.
cy: Mae hwn yn wasanaeth newydd – bydd eich <a href="/cy/feedback">adborth</a> yn ein helpu i'w wella.

source: Search...
cy: Chwilio...

source: Is there anything wrong with this page?
cy: Oes rhywbeth o’i le â’r dudalen hon?

source: Close
cy: Cau

source: Subject
cy: Pwnc

source: Message
cy: Neges

source: Send message
cy: Anfon neges

source: Step @start of @end
cy: Cam @start o @end

# Long month name
source: January
cy: Ionawr

# Long month name
source: February
cy: Chwefror

# Long month name
source: March
cy: Mawrth

# Long month name
source: April
cy: Ebrill

# Long month name
source: May
cy: Mai

# Long month name
source: June
cy: Mehefin

# Long month name
source: July
cy: Gorffennaf

# Long month name
source: August
cy: Awst

# Long month name
source: September
cy: Medi

# Long month name
source: October
cy: Hydref

# Long month name
source: November
cy: Tachwedd

# Long month name
source: December
cy: Rhagfyr

source: <span class="@class_number">@count</span> page
cy: <span class="@class_number">@count</span> tudalen

source: <span class="@class_number">@count</span> food hygiene ratings result
cy: <span class="@class_number">@count</span> canlyniad sgôr hylendid bwyd

source: <span class="@class_number">@count</span> result found
cy: <span class="@class_number">@count</span> wedi dod o hyd i ganlyniad

source: <span class="@class_number">@count</span> result found for <span class="@class_keyword">%keywords</span>
cy: <span class="@class_number">@count</span> wedi dod o hyd i ganlyniad ar gyfer <span class="@class_keyword">%keywords</span>

source: Contact us
cy: Cysylltu â ni

source: Report a food problem, give us feedback or find our contact details.
cy: Rhoi gwybod am broblem gyda bwyd, rhoi adborth i ni neu ddod o hyd i'n manylion cyswllt.

source: Please enter a business name/location or use search options below.
cy: Rhowch enw/lleoliad y busnes yn y DU neu ddefnyddio'r opsiynau chwilio isod.

source: !main_view_string and !ratings_string found for <span class="@class_keyword">%keywords</span>
cy: !main_view_string a !ratings_string ar gyfer <span class="@class_keyword">%keywords</span>

source: !ratings_string found for <span class="@class_keyword">%keywords</span>
cy: !ratings_string ar gyfer <span class="@class_keyword">%keywords</span>

source: !main_view_string and !ratings_string found
cy: !main_view_string a !ratings_string wedi canfod

source: !ratings_string found
cy: !ratings_string wedi canfod

source: Refine search
cy: Chwilio'n fanylach

source: Open
cy: Ar agor

source: Closed
cy: Wedi’i orffen

source: Responses published
cy: Ymatebion wedi'u cyhoeddi
